import '../Home.css'

const MadAbout = () => {


    return ( 
        <div className="med-info-container">
            <div className="med-info-content-container">
                <h2 style={{color: '#4a8b71', textAlign: 'center'}}>სერვისები</h2>

                <div className='mid-info-content'>
                    <ul>
                        <li>დასაქმების უნარები;</li>
                        <li>პროფ-ორიენტაცია და კარიერული განვითარება;</li>
                        <li>პროფესიული კომუნიკაციები;</li>
                        <li>პიროვნული ზრდა და განვითარება;</li>
                        <li>პროფესიული გადაწევა და პრევენცია;</li>
                        <li>სამუშაო ადგილზე კონფლიქტების და სტრესის მართვა;</li>
                        <li>სამოქალაქო ჩართულობა და ლიდერობა;</li>
                        <li>ფინანსური წიგნიერება;</li>
                        <li>მეწარმეობა;</li>
                        <li>სამართლებლივი კონსულტაცია;</li>
                        <li>ბავშთა უფლებები;</li>
                        <li>გენდერული მეინსტრიმინგი და ბიუჯეტირება;</li>
                        <li>რეკრუტინგი;</li>
                        <li>თანამშრომელთა კარიერული გაძლიერება;</li>
                        <li>ორგანიზაციის მართვა და განვითარება;</li>
                        <li>შრომის ორგანიზაციული კულტურა და კორპორატიული ლოიალიზმი;</li>
                        <li>სამუშაოს შესრულების ინდიკატორები და მოტივაცია;</li>
                    </ul>
                </div>
            </div>
        </div>
     );
}
 
export default MadAbout;