import '../Home.css'

const MadAbout = () => {


    return ( 
        <div className="med-info-container">
            <div className='med-info-content'>
                <h2 className='med-info-header'>სერვისები</h2>

                    <ul>
                        <li>დასაქმების უნარები;</li>
                        <li>პროფ-ორიენტაცია და კარიერული განვითარება;</li>
                        <li>პროფესიული კომუნიკაციები;</li>
                        <li>პიროვნული ზრდა და განვითარება;</li>
                        <li>პროფესიული გადაწევა და პრევენცია;</li>
                        <li>სამუშაო ადგილზე კონფლიქტების და სტრესის მართვა;</li>
                        <li>სამოქალაქო ჩართულობა და ლიდერობა;</li>
                        <li>ფინანსური წიგნიერება;</li>
                        <li>მეწარმეობა;</li>
                        <li>სამართლებლივი კონსულტაცია;</li>
                        <li>ბავშთა უფლებები;</li>
                        <li>გენდერული მეინსტრიმინგი და ბიუჯეტირება;</li>
                        <li>რეკრუტინგი;</li>
                        <li>თანამშრომელთა კარიერული გაძლიერება;</li>
                        <li>ორგანიზაციის მართვა და განვითარება;</li>
                        <li>შრომის ორგანიზაციული კულტურა და კორპორატიული ლოიალიზმი;</li>
                        <li>სამუშაოს შესრულების ინდიკატორები და მოტივაცია;</li>
                        <li>ეფექტური მომსახურების უნარები;</li>
                        <li>ბულინგის პრევენცია და ინტერვენცია საგანმანათლებლო გარემოში;</li>
                        <li>პროექტების მენეჯმენტი;</li>
                        <li>სამუშაო ადგილზე თანასწორობის შიდა პოლიტიკის დოკუმენტაციის შექმნა;</li>
                        <li>კვლევის დიზაინი და განხორციელება;</li>
                        <li>სტაჟირების პროგრამა;</li>
                        <li>გაცვლითი პროგრამა;</li>
                        <li>დასაქმების ხელშემწყობი ღონისძიებების დაგეგმვა და განხორციელება;</li>
                        <li>უცხო ენა;</li>
                    </ul>
            </div>
        </div>
     );
}
 
export default MadAbout;