const MiniPannelCompo = () => {
    return ( 
        <>
        <div className="mini-info1">
            <p className="mini-pannel-header">მიზნები</p>

            <p style={{paddingInline: "10px"}}>1. ადამიანების პროფესიული და კარიერული განვითარების ხელშეწყობა;<br /><br />
            2. ძლიერი პროფესიული ქსელის შექმნა სახელმწიფოს, საგანმანათლებლო დაწესებულებებს, დამსაქმებლებს და სამუშაო მაძიებელთა შორის;<br /><br />
            3. ღირსეული შრომის პირობების დანერგვის ხელშეწყობა;<br /><br />
            4. სამუშაო ადგილებზე დისკრიმინაციისა და შევიწროებისაგან თავისუფალი გარემოს შექმნაში მხარდაჭერა;<br /><br />
            5. სოციალურ-ეკონომიკურ პროცესებში ახალგაზრდებისა და ქალების მონაწილეობის წახალისება და ჩართულობის გაძლიერება;
            </p>
        </div>


        <div className="mini-info2">
            <p className="mini-pannel-header">ხედვა</p>

            <p style={{paddingInline: "10px"}}>ყველას აქვს უფლება იყოს ბედნიერი, ჰქონდეს პროფესიის არჩევის, დასაქმებისა და ღირსეული შრომის პრინციპების რეალიზაციის თავისუფლება.</p>
        </div>

        <div className="mini-info3">
            <p className="mini-pannel-header">მისია</p>

            <p style={{paddingInline: "10px"}}>ადგილობრივ და საერთაშორის შრომის ბაზარზე დასაქმების შესაძლებლობების გაძლიერება, განსაკუთრებით, ახალგაზრდებისა და ქალებისთვის, არაფორმალური განათლების ხელმისაწვდომობის გაზრდით და დასაქმების პოლიტიკის ხელშეწყობით</p>
        </div>

        <div className="mini-info4">
            <p className="mini-pannel-header">შესაძლებლობები</p>

            <p style={{paddingInline: "10px"}}>1. საქმიანობის გეოგრაფიული არეალის გაფართოება;<br /><br />
            2. ფინანსური მდგომარეობის უზრუნველყოფა ფასიანი სერვისების მოწოდების გაზრდით;<br /><br />
            3. ცნობადობის გაზრდა;<br /><br />
            4. საერთაშორისო თანამშრომლობის გაძლიერება;<br /><br />
            5. მსხვილი პროექტების განხორციელება;<br /><br />
            6. დასაქმების პოლიტიკის შექმნის პროცესებში როლის გაზრდა;<br /><br /></p>
        </div>
        </>
     );
}
 
export default MiniPannelCompo;